Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_cnano/pic32cm_jh01_cnano_getting_started/firmware/src/packs/PIC32CM5164JH01048_DFP/component/dsu.h
#define DSU_STATUSB_DCCD_Pos                  _UINT8_(2)                                           /* (DSU_STATUSB Position) Debug Communication Channel x Dirty */
#define DSU_STATUSB_DCCD_Msk                  (_UINT8_(0x3) << DSU_STATUSB_DCCD_Pos)               /* (DSU_STATUSB Mask) DCCD */
#define DSU_STATUSB_DCCD(value)               (DSU_STATUSB_DCCD_Msk & (_UINT8_(value) << DSU_STATUSB_DCCD_Pos)) 

/* -------- DSU_ADDR : (DSU Offset: 0x04) (R/W 32) Address -------- */
#define DSU_ADDR_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_ADDR) Address  Reset Value */

#define DSU_ADDR_AMOD_Pos                     _UINT32_(0)                                          /* (DSU_ADDR) Access Mode Position */
#define DSU_ADDR_AMOD_Msk                     (_UINT32_(0x3) << DSU_ADDR_AMOD_Pos)                 /* (DSU_ADDR) Access Mode Mask */
#define DSU_ADDR_AMOD(value)                  (DSU_ADDR_AMOD_Msk & (_UINT32_(value) << DSU_ADDR_AMOD_Pos)) /* Assigment of value for AMOD in the DSU_ADDR register */
#define DSU_ADDR_ADDR_Pos                     _UINT32_(2)                                          /* (DSU_ADDR) Address Position */
#define DSU_ADDR_ADDR_Msk                     (_UINT32_(0x3FFFFFFF) << DSU_ADDR_ADDR_Pos)          /* (DSU_ADDR) Address Mask */
#define DSU_ADDR_ADDR(value)                  (DSU_ADDR_ADDR_Msk & (_UINT32_(value) << DSU_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the DSU_ADDR register */
#define DSU_ADDR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (DSU_ADDR) Register Mask  */


/* -------- DSU_LENGTH : (DSU Offset: 0x08) (R/W 32) Length -------- */
#define DSU_LENGTH_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_LENGTH) Length  Reset Value */

#define DSU_LENGTH_LENGTH_Pos                 _UINT32_(2)                                          /* (DSU_LENGTH) Length Position */
#define DSU_LENGTH_LENGTH_Msk                 (_UINT32_(0x3FFFFFFF) << DSU_LENGTH_LENGTH_Pos)      /* (DSU_LENGTH) Length Mask */
#define DSU_LENGTH_LENGTH(value)              (DSU_LENGTH_LENGTH_Msk & (_UINT32_(value) << DSU_LENGTH_LENGTH_Pos)) /* Assigment of value for LENGTH in the DSU_LENGTH register */
#define DSU_LENGTH_Msk                        _UINT32_(0xFFFFFFFC)                                 /* (DSU_LENGTH) Register Mask  */


/* -------- DSU_DATA : (DSU Offset: 0x0C) (R/W 32) Data -------- */
#define DSU_DATA_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_DATA) Data  Reset Value */

#define DSU_DATA_DATA_Pos                     _UINT32_(0)                                          /* (DSU_DATA) Data Position */
#define DSU_DATA_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << DSU_DATA_DATA_Pos)          /* (DSU_DATA) Data Mask */
#define DSU_DATA_DATA(value)                  (DSU_DATA_DATA_Msk & (_UINT32_(value) << DSU_DATA_DATA_Pos)) /* Assigment of value for DATA in the DSU_DATA register */
#define DSU_DATA_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (DSU_DATA) Register Mask  */


/* -------- DSU_DCC : (DSU Offset: 0x10) (R/W 32) Debug Communication Channel n -------- */
#define DSU_DCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_DCC) Debug Communication Channel n  Reset Value */

#define DSU_DCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_DCC) Data Position */
#define DSU_DCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_DCC_DATA_Pos)           /* (DSU_DCC) Data Mask */
#define DSU_DCC_DATA(value)                   (DSU_DCC_DATA_Msk & (_UINT32_(value) << DSU_DCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_DCC register */
#define DSU_DCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DCC) Register Mask  */


/* -------- DSU_DID : (DSU Offset: 0x18) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE                    _UINT32_(0x11060100)                                 /*  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_DEVSEL_Pos                    _UINT32_(0)                                          /* (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk                    (_UINT32_(0xFF) << DSU_DID_DEVSEL_Pos)               /* (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                 (DSU_DID_DEVSEL_Msk & (_UINT32_(value) << DSU_DID_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the DSU_DID register */
#define   DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN_Val _UINT32_(0x0)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN_Val _UINT32_(0x1)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN_Val _UINT32_(0x2)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN_Val _UINT32_(0x3)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN_Val _UINT32_(0x4)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN_Val _UINT32_(0x5)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN_Val _UINT32_(0x6)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN_Val _UINT32_(0x7)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN_Val _UINT32_(0xB)                                        /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val _UINT32_(0xA)                                        /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN_Val _UINT32_(0xD)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN_Val _UINT32_(0xE)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN_Val _UINT32_(0xF)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN_Val _UINT32_(0x10)                                       /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN_Val _UINT32_(0x13)                                       /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN_Val _UINT32_(0x14)                                       /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN_Val _UINT32_(0x15)                                       /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN_Val _UINT32_(0x16)                                       /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / No CAN  */
#define DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN  (DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN  (DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / No CAN Position  */
#define DSU_DID_REVISION_Pos                  _UINT32_(8)                                          /* (DSU_DID) Revision Number Position */
#define DSU_DID_REVISION_Msk                  (_UINT32_(0xF) << DSU_DID_REVISION_Pos)              /* (DSU_DID) Revision Number Mask */
#define DSU_DID_REVISION(value)               (DSU_DID_REVISION_Msk & (_UINT32_(value) << DSU_DID_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_DID register */
#define DSU_DID_DIE_Pos                       _UINT32_(12)                                         /* (DSU_DID) Die Number Position */
#define DSU_DID_DIE_Msk                       (_UINT32_(0xF) << DSU_DID_DIE_Pos)                   /* (DSU_DID) Die Number Mask */
#define DSU_DID_DIE(value)                    (DSU_DID_DIE_Msk & (_UINT32_(value) << DSU_DID_DIE_Pos)) /* Assigment of value for DIE in the DSU_DID register */
#define DSU_DID_SERIES_Pos                    _UINT32_(16)                                         /* (DSU_DID) Series Position */
#define DSU_DID_SERIES_Msk                    (_UINT32_(0x3F) << DSU_DID_SERIES_Pos)               /* (DSU_DID) Series Mask */
#define DSU_DID_SERIES(value)                 (DSU_DID_SERIES_Msk & (_UINT32_(value) << DSU_DID_SERIES_Pos)) /* Assigment of value for SERIES in the DSU_DID register */
#define   DSU_DID_SERIES_JH00_JH01_Val        _UINT32_(0x6)                                        /* (DSU_DID) PIC32CM JH00 and PIC32CM JH01  */
#define DSU_DID_SERIES_JH00_JH01              (DSU_DID_SERIES_JH00_JH01_Val << DSU_DID_SERIES_Pos) /* (DSU_DID) PIC32CM JH00 and PIC32CM JH01 Position  */
#define DSU_DID_FAMILY_Pos                    _UINT32_(23)                                         /* (DSU_DID) Family Position */
#define DSU_DID_FAMILY_Msk                    (_UINT32_(0x1F) << DSU_DID_FAMILY_Pos)               /* (DSU_DID) Family Mask */
#define DSU_DID_FAMILY(value)                 (DSU_DID_FAMILY_Msk & (_UINT32_(value) << DSU_DID_FAMILY_Pos)) /* Assigment of value for FAMILY in the DSU_DID register */
#define   DSU_DID_FAMILY_5V_Industrial_Val    _UINT32_(0x2)                                        /* (DSU_DID) 5V Industrial  */
#define DSU_DID_FAMILY_5V_Industrial          (DSU_DID_FAMILY_5V_Industrial_Val << DSU_DID_FAMILY_Pos) /* (DSU_DID) 5V Industrial Position  */
#define DSU_DID_PROCESSOR_Pos                 _UINT32_(28)                                         /* (DSU_DID) Processor Position */
#define DSU_DID_PROCESSOR_Msk                 (_UINT32_(0xF) << DSU_DID_PROCESSOR_Pos)             /* (DSU_DID) Processor Mask */
#define DSU_DID_PROCESSOR(value)              (DSU_DID_PROCESSOR_Msk & (_UINT32_(value) << DSU_DID_PROCESSOR_Pos)) /* Assigment of value for PROCESSOR in the DSU_DID register */
#define   DSU_DID_PROCESSOR_CM0P_Val          _UINT32_(0x1)                                        /* (DSU_DID) Cortex-M0+  */
#define DSU_DID_PROCESSOR_CM0P                (DSU_DID_PROCESSOR_CM0P_Val << DSU_DID_PROCESSOR_Pos) /* (DSU_DID) Cortex-M0+ Position  */
#define DSU_DID_Msk                           _UINT32_(0xFFBFFFFF)                                 /* (DSU_DID) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE                 _UINT32_(0x9F0FC002)                                 /*  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY0_EPRES_Pos)              /* (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY0_EPRES_Pos)) /* Assigment of value for EPRES in the DSU_ENTRY0 register */
#define DSU_ENTRY0_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY0_FMT_Pos)                /* (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & (_UINT32_(value) << DSU_ENTRY0_FMT_Pos)) /* Assigment of value for FMT in the DSU_ENTRY0 register */
#define DSU_ENTRY0_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)         /* (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY0_ADDOFF_Pos)) /* Assigment of value for ADDOFF in the DSU_ENTRY0 register */
#define DSU_ENTRY0_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

